[
  {
    "title": "HTML Exercise",
    "description": "This project was pivotal in honing my HTML skills. Leveraging only HTML and simple CSS through CDNs, I crafted a multi-page static website. Through this endeavor, I gained hands-on experience in structuring web content effectively and learned the fundamentals of website navigation.",
    "link": "https://kasimpasaogluhtml.netlify.app/",
    "img": "src/images/html1ss.png"
  },
  {
    "title": "HTML Exercise 2",
    "description": "In this project, I strengthened my HTML skills by creating a website for a company, simulating the process as if I were working for a friend. I utilized my HTML knowledge and ready-made CSS services to accomplish the task.",
    "link": "https://kasimpasaogluhtml2.netlify.app/",
    "img": "src/images/html2ss.png"
  },
  {
    "title": "Cloning PicoCSS",
    "description": "In this project, I delved into CSS fundamentals by replicating the PicoCSS structure with my own CSS code. By meticulously examining the PicoCSS documentation, I aimed to create my own CSS structure as closely as possible. This provided a valuable exercise in understanding CSS principles and techniques.",
    "link": "https://pico-clone-kasim.netlify.app/",
    "img": "src/images/picocss.png"
  },
  {
    "title": "CSS Exercise",
    "description": "I crafted a website from scratch using HTML and CSS, experimenting with various colors and layouts. Due to limited exposure to concepts like flex and media queries, the design is tailored primarily for desktop screens.",
    "link": "https://css-training-kasim.netlify.app/",
    "img": "src/images/css1ss.png"
  },
  {
    "title": "SCSS Exercise",
    "description": "I tackled a challenge I found on Frontend Mentor, striving to replicate the structures as faithfully as possible using SCSS. Additionally, I made the page mobile-responsive with flexbox and media queries.",
    "link": "https://scsstraining.netlify.app/",
    "img": "src/images/scss.png"
  },
  {
    "title": "Bootstrap Exercise",
    "description": "By grasping the fundamentals and logic of Bootstrap, I created a page. Without establishing a custom CSS structure, I customized various usage examples by copying basic Bootstrap knowledge, tailoring them to my needs.",
    "link": "https://bootstraptraining-kasim.netlify.app/",
    "img": "src/images/bootstrapss.png"
  },
  {
    "title": "JavaScript SPA Exercise",
    "description": "This project is a single page application (SPA) using hash routing to load content dynamically with JavaScript and Fetch API. The navigation bar is styled with Bootstrap to highlight the active page. This project improved my JavaScript skills and understanding of modern web development techniques.",
    "link": "https://jsspapractise.netlify.app/",
    "img": "src/images/JsSpaExercise.png"
  },
  {
    "title": "React LoremPicsum Generator",
    "description": "In this project, I created an image gallery using React, focusing on useState and useEffect hooks. The gallery fetches images from Lorem Picsum, allowing users to add new images dynamically. If there are empty links, the application queries them using the Fetch API. This project provided a deeper understanding of React's state management and the integration of external APIs.",
    "link": "https://lorempicsumgenerator.netlify.app/",
    "img": "src/images/lorempicsumreact.png"
  },
  {
    "title": "React To-Do List Exercise",
    "description": "In this project, I built a dynamic To-Do List application using React. By practicing with useState and useEffect hooks, I developed features allowing users to add, mark, edit, and delete tasks. Additionally, I implemented a filter button to display only prioritized items. This project enhanced my understanding of React's core concepts and state management.",
    "link": "https://kasim-todo-react.netlify.app/",
    "img": "src/images/reacttodo.png"
  }
]